/*
G11 "Заканчивается на a"

В файле .txt дано предложение.
Необходимо определить, сколько слов заканчиваются на букву 'а'.
Ответ записать в файл .txt.

Данные на входе:
  Строка из английских букв и пробелов не более 1000 символов.

Данные на выходе:
  Одно целое число 

Пример
Данные на входе:
  Mama mila ramu 
Данные на выходе:
  2 

*/

#include <stdio.h>

#define INFILE  "in.txt"
#define OUTFILE "out.txt"

int main(void)
{
    FILE *f = fopen(INFILE, "r+");



    fclose(f);
    return 0;
}
