/*
B18 Будет решена в следующей лекции
Числа Фибоначчи

Вывести на экран ряд чисел Фибоначчи, состоящий из n
элементов.
Числа Фибоначчи – это элементы числовой
последовательности
1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, …,
в которой каждое последующее число равно сумме двух
предыдущих.

Данные на входе:
  Одно натуральное число 
Данные на выходе:
  Ряд чисел Фибоначчи через пробел 

Пример №1
Данные на входе:  5 
Данные на выходе: 1 1 2 3 5 

Пример №2
Данные на входе:  10
Данные на выходе: 1 1 2 3 5 8 13 21 34 55 
*/

#include <stdio.h>

int main(void)
{
	return 0;
}
