/*
D15
Найти наибольшее

Дана последовательность ненулевых целых чисел, завершающаяся числом 0. Ноль в последовательность не входит. Определите наибольшее значение числа в этой последовательности. Для решения задачи необходимо написать рекурсивную функцию вида:
int max_find(int max)

Данные на входе: 		Последовательность не нулевых целых чисел. В конце последовательности число 0. 
Данные на выходе: 	Одно число. Максимум последовательности. 

Пример
Данные на входе: 		1 12 2 5 8 0 
Данные на выходе: 	12 
*/

#include <stdio.h>

int main(void)
{
	int number;
	scanf("%d", &number);

	return 0;
}
