/*
C7 Демо 2
Перевести число N в систему счисления P
Составить функцию, которая переводит число N из десятичной системы счисления в P-ичную систему счисления.

Данные на входе: 		Два целых числа. N >= 0 и  2 <= P <= 9
Данные на выходе: 	Одно целое число

Пример №1
Данные на входе: 		25 5
Данные на выходе: 	100

Пример №2
Данные на входе: 		9 2
Данные на выходе: 	1001

Пример №3
Данные на входе: 		11 3
Данные на выходе: 	102
*\

#include <stdio.h>

int main(void)
{
	int number;
	scanf("%d", &number);

	return 0;
}
