/*
C10 Решена на лекции
Простые множители

Составить функцию, печать всех простых множителей числа. Использовать ее для печати всех простых множителей числа.
void print_simple(int n)
Данные на входе: 		Целое положительное число. 
Данные на выходе: 	Последовательность всех простых множителей данного числа в порядке возрастания. 

Пример №1
Данные на входе: 		12 
Данные на выходе: 	2 2 3 

Пример №2
Данные на входе: 		120 
Данные на выходе: 	2 2 2 3 5
*/

#include <stdio.h>

int main(void)
{
	int number;
	scanf("%d", &number);

	return 0;
}
