/*
C19 Решена на лекции
Сумма цифр в тексте
Составить функцию, которая преобразует текущий символ цифры в число. Написать программу считающую сумму цифр в тексте.
int digit_to_num(char c)

Данные на входе: 		Строка состоящая из английских букв, пробелов, знаков препинания. В конце строки символ точка. 
Целое число - сумма цифр в тексте 

Пример №1
Данные на входе: 		1Hello 36world. 
Данные на выходе: 	10 

Пример №2
Данные на входе: 		abc 1def2 3. 
Данные на выходе: 	6 
*/

#include <stdio.h>

int main(void)
{
	int number;
	scanf("%d", &number);

	return 0;
}
